[
  {
    "id": "about-contoso-001",
    "title": "About Contoso Paints",
    "content": "About Contoso Paints: Contoso Paints is built on a simple belief: color should be inspiring, not intimidating. We've been creating premium interior and exterior paints that balance performance with sustainability. By merging design and science, our paints aren't just color — they're engineered surfaces. Each formula uses nanocoating technology for enhanced stain resistance, self-leveling application, and extended longevity. Our eco-tech low-VOC blends reduce environmental impact without sacrificing performance. Color isn't just chosen; it's calibrated. Every shade is generated using precision color fidelity algorithms, ensuring the hue you pick is the hue that lives on your wall — in natural light, LED, or daylight-balanced settings. Whether you're a homeowner, architect, or contractor, our paints are designed to work harder, last longer, and look sharper.",
    "category": "company",
    "keywords": ["about", "company", "contoso paints", "nanocoating", "eco-tech", "low-VOC", "sustainability", "technology"]
  },
  {
    "id": "return-policy-001",
    "title": "Return Policy",
    "content": "Return Policy: We want you to love your color. If you're not happy with your paint, you can return it within 30 days of purchase for a refund or exchange. Items must be in their original containers with the label intact. Custom-tinted paints are final sale. To start a return, email returns@contosopaints.com with your order number. Refunds will be issued to your original payment method once we receive your return. For assistance, call +1 (800) 555-0199 or chat with our support team.",
    "category": "returns",
    "keywords": ["return", "refund", "exchange", "30 days", "return policy", "custom-tinted", "final sale"]
  },
  {
    "id": "warranty-policy-001",
    "title": "Product Warranty",
    "content": "Product Warranty: Contoso Paints are backed by a 2-year performance warranty covering tint accuracy, film integrity, and nanocoating defects. This warranty ensures your walls resist premature fading, peeling, or coating failure under normal use. If your paint arrives damaged, contact us within 7 days. We'll replace or refund any shipment with leaking cans, damaged seals, or color mismatch.",
    "category": "warranty",
    "keywords": ["warranty", "guarantee", "2-year", "performance warranty", "tint accuracy", "film integrity", "nanocoating", "defects", "coverage"]
  },
  {
    "id": "faq-nanocoating-001",
    "title": "FAQ: How does nanocoating improve paint?",
    "content": "How does nanocoating improve paint? Nanocoating builds microscopic layers that repel stains, resist scuffs, and improve washability. It also helps paint 'self-heal' minor surface abrasions.",
    "category": "faq",
    "keywords": ["nanocoating", "technology", "stain resistance", "washability", "self-heal", "durability"]
  },
  {
    "id": "faq-coverage-001",
    "title": "FAQ: Paint Coverage",
    "content": "How much coverage do I get per gallon? On average, 1 gallon covers 350–400 sq ft in a single coat. Thanks to our optimized pigment dispersion, many projects require fewer coats compared to standard paints.",
    "category": "faq",
    "keywords": ["coverage", "gallon", "square feet", "how much paint", "paint calculator", "pigment dispersion"]
  },
  {
    "id": "faq-eco-friendly-001",
    "title": "FAQ: Eco-Friendly Paint",
    "content": "Are your paints eco-friendly? Yes. Our eco-tech line is certified low-VOC and manufactured in facilities powered by renewable energy. Cans are recyclable, and formulas are compliant with strict indoor air quality standards.",
    "category": "faq",
    "keywords": ["eco-friendly", "low-VOC", "sustainable", "renewable energy", "recyclable", "indoor air quality", "environmental"]
  },
  {
    "id": "faq-color-matching-001",
    "title": "FAQ: Color Matching",
    "content": "Do you offer color matching? Yes. Our AI-powered color scanner can match textiles, photos, or competitor swatches with 95%+ accuracy. You'll see a digital preview before final tinting.",
    "category": "faq",
    "keywords": ["color matching", "AI", "color scanner", "swatches", "tinting", "digital preview"]
  },
  {
    "id": "faq-durability-001",
    "title": "FAQ: Paint Durability",
    "content": "How durable is Contoso Paint? Our fade-shield technology resists UV light degradation, keeping colors vivid even in bright, sunlit spaces. High-traffic areas benefit from extra abrasion resistance in our Pro line.",
    "category": "faq",
    "keywords": ["durability", "fade-shield", "UV resistance", "high-traffic", "Pro line", "abrasion resistance"]
  },
  {
    "id": "faq-outdoor-use-001",
    "title": "FAQ: Outdoor Paint",
    "content": "Can your paints be used outdoors? Yes — our ExteriorGuard series is weather-rated, with hydrophobic barriers that repel rain, protect against mildew, and expand/contract with temperature shifts to avoid cracking.",
    "category": "faq",
    "keywords": ["outdoor", "exterior", "ExteriorGuard", "weather-rated", "hydrophobic", "mildew", "temperature", "exterior paint"]
  },
  {
    "id": "faq-primer-001",
    "title": "FAQ: Primer Requirements",
    "content": "Do I need primer? Most surfaces benefit from primer for best adhesion. However, our 2-in-1 self-priming formulas bond directly to drywall, plaster, or pre-painted walls, cutting down on prep time.",
    "category": "faq",
    "keywords": ["primer", "self-priming", "2-in-1", "adhesion", "drywall", "plaster", "prep"]
  },
  {
    "id": "faq-damaged-shipment-001",
    "title": "FAQ: Damaged Shipment",
    "content": "What if my paint arrives damaged? Contact us within 7 days. We'll replace or refund any shipment with leaking cans, damaged seals, or color mismatch.",
    "category": "faq",
    "keywords": ["damaged", "shipment", "leaking", "damaged cans", "replacement", "refund"]
  },
  {
    "id": "faq-recycle-paint-001",
    "title": "FAQ: Paint Recycling",
    "content": "Can I recycle leftover paint? Yes. We partner with regional eco-drop centers to recycle both cans and unused product. Ask support for your nearest facility.",
    "category": "faq",
    "keywords": ["recycle", "leftover paint", "eco-drop", "sustainability", "disposal", "environmental"]
  },
  {
    "id": "faq-order-tracking-001",
    "title": "FAQ: Order Tracking",
    "content": "How do I track my order? You can track your order using the tracking number provided in your shipment confirmation email.",
    "category": "faq",
    "keywords": ["tracking", "order tracking", "shipment", "tracking number", "order status"]
  },
  {
    "id": "faq-international-shipping-001",
    "title": "FAQ: International Shipping",
    "content": "Do you ship internationally? Yes, we offer worldwide shipping. Shipping fees and delivery times vary by location.",
    "category": "faq",
    "keywords": ["international", "worldwide shipping", "shipping fees", "delivery times", "global"]
  },
  {
    "id": "faq-cancel-order-001",
    "title": "FAQ: Order Cancellation",
    "content": "Can I cancel my order? Orders can be canceled before they are shipped. Once shipped, you will need to follow the return policy.",
    "category": "faq",
    "keywords": ["cancel", "cancellation", "order cancellation", "cancel order", "before shipping"]
  },
  {
    "id": "faq-bulk-discounts-001",
    "title": "FAQ: Bulk Discounts",
    "content": "Do you offer bulk discounts? Yes, please contact sales@example.com for bulk purchasing information.",
    "category": "faq",
    "keywords": ["bulk", "discounts", "wholesale", "bulk purchasing", "volume pricing", "contractor"]
  }
]
